a = prompt('Введите число');
b = prompt ('Введите число');
for(; a < b; a++) {
	if(	a % 2 == 0 ){
		c= a*a;
		console.log(c);
	}
};
//****************************************************************************************************************

do{
	a = prompt('Введите число');
} while(isNaN(a))



// ****************************************************************************************************************

a = prompt('Введите число ');
i = 2;
for (; i * i  <= a; i++){
	if (a % i == 0){
		alert(`Число: ${a}`+ ' сложное');
	} else {
		alert(`Число: ${a}`+ ' простое');
	}
}
// *****************************************************************************************************************-

let sum = 0;
for (i = 2; i < 250; i++) {
	let isPrime = true;
  for ( k = 2; k < i; k++) {
    if (i % k === 0) {
      isPrime = false;
		}
  } if (isPrime) {
    sum += i;
  }
}
console.log(sum);